Tekla Open API Reference for Tekla Structures 2025
ControlArc.Color Property
 Gets or sets color of the control arc.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlObjectColorEnum Color { get; set; }
Public Property Color As ControlObjectColorEnum
	Get
	Set
Property Value
Type: ControlObjectColorEnum
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace